test_config/cfe/Catalogs/AVS_КатегорииНоменклатурыСайт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>AVS_КатегорииНоменклатурыСайт</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СсылкаНаИзображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

test_config/cfe/InformationRegisters/AVS_СоставКатегорийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>AVS_СоставКатегорийНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СвязкаАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVS_КатегорииНоменклатурыСайт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

test_config/cfe/Catalogs/AVS_КатегорииНоменклатурыСайт/Forms/AVS_ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		ИмяСписка = "Список";
		
		// 1. ОБЕСПЕЧИВАЕМ НАЛИЧИЕ РЕКВИЗИТА
		// Если реквизита "Список" нет в метаданных формы, создаем его динамически
		Если Не AVS_РеквизитСуществует(ИмяСписка) Тогда
			AVS_ДФИ.СоздатьРеквизит(ЭтаФорма, ИмяСписка, AVS_ДФИ.ОписаниеТипаДинамическийСписок());
			ЭтаФорма[ИмяСписка].ОсновнаяТаблица = "Справочник.AVS_КатегорииНоменклатурыСайт";
		КонецЕсли;
		
		
		// 2. ОБЕСПЕЧИВАЕМ НАЛИЧИЕ ЭЛЕМЕНТА (ТАБЛИЦЫ) НА ФОРМЕ
		// В типовых формах реквизит может быть, а сам элемент на форму не выведен
		ЭлементСписок = Элементы.Найти(ИмяСписка);
		Если ЭлементСписок = Неопределено Тогда
			
			// Описание колонок для новой таблицы
			СтруктураКолонок = Новый Структура;
			
			СтруктураКолонок.Вставить("Наименование", "Наименование категории");
			СтруктураКолонок.Вставить("СсылкаНаИзображение", "Ссылка на изображение");
			СтруктураКолонок.Вставить("ПорядокСортировки", "Порядок");
			
			// Создаем таблицу формы в корне (Родитель = Неопределено)
			ЭлементСписок = AVS_ДФИ.СздТаблицаФормы(
				ЭтаФорма, 
				ИмяСписка, 
				Неопределено, // Размещение в корне формы
				ИмяСписка,    // Путь к данным (реквизит "Список")
				СтруктураКолонок
			);
			
			Сообщить("[AVS DEBUG]: Таблица 'Список' создана программно.");
		КонецЕсли;
		
		ЭтаФорма.КоманднаяПанель.Видимость = Ложь;
		
		// 3. ФИНАЛЬНАЯ НАСТРОЙКА ВИДИМОСТИ И ОТОБРАЖЕНИЯ
		Если ЭлементСписок <> Неопределено Тогда
			
			// Устанавливаем режим дерева для иерархического отображения
			ЭлементСписок.Отображение = ОтображениеТаблицы.Дерево;
			
			ЭлементСписок.ИзменятьСоставСтрок = Ложь;
			
			
			
			// Размещаем панель таблицы сверху (она содержит поле поиска и "Еще")
			ЭлементСписок.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Верх;
			
			// Настройки размеров и видимости
			ЭлементСписок.Видимость = Истина;
			ЭлементСписок.РастягиватьПоВертикали = Истина;
			ЭлементСписок.Высота = 15; 
			
			// Настройка заголовков
			
			AVS_НастроитьЗаголовокКолонки(ИмяСписка + "Наименование", "Наименование категории");
			AVS_НастроитьЗаголовокКолонки(ИмяСписка + "СсылкаНаИзображение", "Ссылка на изображение");
			AVS_НастроитьЗаголовокКолонки(ИмяСписка + "ПорядокСортировки", "Порядок");
			
			// --- ДОБАВЛЕНИЕ КНОПОК  ---
// Команда Создать
ИмяКомандыСоздать = "AVS_СоздатьКатегорию";
КомандаСоздания = ЭтаФорма.Команды.Добавить(ИмяКомандыСоздать);
КомандаСоздания.Действие = "AVS_СоздатьКатегорию";
КомандаСоздания.Заголовок = "Создать категорию";
КомандаСоздания.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;


НоваяКнопкаСоздать = Элементы.Добавить("AVS_КнопкаСоздать", Тип("КнопкаФормы"), Элементы.СписокКоманднаяПанель);
НоваяКнопкаСоздать.ИмяКоманды = ИмяКомандыСоздать;
НоваяКнопкаСоздать.Отображение = ОтображениеКнопки.КартинкаИТекст;

// Команда Вверх
ИмяКомандыВверх = "AVS_ПереместитьВверх";
КомандаВверх = ЭтаФорма.Команды.Добавить(ИмяКомандыВверх);
КомандаВверх.Действие = "AVS_ПереместитьВверх";
КомандаВверх.Заголовок = "Вверх";
КомандаВверх.Картинка = БиблиотекаКартинок.ПереместитьВверх;

НоваяКнопкаВверх = Элементы.Добавить("AVS_КнопкаВверх", Тип("КнопкаФормы"), Элементы.СписокКоманднаяПанель);
НоваяКнопкаВверх.ИмяКоманды = ИмяКомандыВверх;
НоваяКнопкаВверх.Отображение = ОтображениеКнопки.Картинка;

// Команда Вниз
ИмяКомандыВниз = "AVS_ПереместитьВниз";
КомандаВниз = ЭтаФорма.Команды.Добавить(ИмяКомандыВниз);
КомандаВниз.Действие = "AVS_ПереместитьВниз";
КомандаВниз.Заголовок = "Вниз";
КомандаВниз.Картинка = БиблиотекаКартинок.ПереместитьВниз;

НоваяКнопкаВниз = Элементы.Добавить("AVS_КнопкаВниз", Тип("КнопкаФормы"), Элементы.СписокКоманднаяПанель);
НоваяКнопкаВниз.ИмяКоманды = ИмяКомандыВниз;
НоваяКнопкаВниз.Отображение = ОтображениеКнопки.Картинка;

// Добавляем команду и кнопку удаления
ИмяКомандыУдалить = "AVS_УдалитьКатегорию";
КомандаУдаления = ЭтаФорма.Команды.Добавить(ИмяКомандыУдалить);
КомандаУдаления.Действие = "AVS_УдалитьКатегорию";
КомандаУдаления.Заголовок = "Удалить";
КомандаУдаления.Картинка = БиблиотекаКартинок.УдалитьЭлементСписка;
КомандаУдаления.ИзменяетСохраняемыеДанные = Ложь;

НоваяКнопка = Элементы.Добавить("AVS_КнопкаУдалить", Тип("КнопкаФормы"), Элементы.СписокКоманднаяПанель);
НоваяКнопка.ИмяКоманды = ИмяКомандыУдалить;
НоваяКнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;


			Сообщить("[AVS DEBUG]: Дублирующая панель скрыта. Поиск и кнопки управления доступны в панели списка.");
		КонецЕсли;
		
	Исключение
		ТекстОшибки = "[AVS ERROR]: Ошибка в ПриСозданииНаСервере: " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		Попытка
			AVS_Логирование.ЗаписатьВЛог(ТекстОшибки);
		Исключение
		КонецПопытки;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура AVS_НастроитьЗаголовокКолонки(ИмяЭлемента, Заголовок)
	
	// Безопасный поиск и установка заголовка
	Элемент = Элементы.Найти(ИмяЭлемента);
	Если Элемент <> Неопределено Тогда
		Попытка
			Элемент.Заголовок = Заголовок;
		Исключение
			// Игнорируем ошибки установки свойств для несовместимых типов
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция AVS_РеквизитСуществует(Имя)
	
	// Проверка наличия реквизита в коллекции формы
	Реквизиты = ЭтаФорма.ПолучитьРеквизиты();
	Для Каждого Рек Из Реквизиты Цикл
		Если Рек.Имя = Имя Тогда 
			Возврат Истина; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// --- ОБРАБОТЧИКИ КОМАНД ---  
// { ПРАВКА_НАЧАЛО: Исправление ошибки видимости AVS_Логирование на клиенте }

&НаКлиенте
Процедура AVS_СоздатьКатегорию(Команда)
	
	Попытка
		Сообщить("[AVS DEBUG]: Запуск команды 'Создать категорию' из списка...");
		
		ТекущаяСсылка = Элементы.Список.ТекущаяСтрока;
		Родитель = Неопределено; 
		
		Если ЗначениеЗаполнено(ТекущаяСсылка) Тогда
			// Проверяем тип через ТипЗнч для безопасной работы в Тонком клиенте
			Если ТипЗнч(ТекущаяСсылка) = Тип("СправочникСсылка.AVS_КатегорииНоменклатурыСайт") Тогда
				Родитель = ТекущаяСсылка;
				Сообщить("[AVS DEBUG]: Новая категория будет подчинена: " + Строка(Родитель));
			КонецЕсли;
		Иначе
			Сообщить("[AVS DEBUG]: Создание категории в корне справочника.");
		КонецЕсли;
		
		// Подготовка параметров открытия
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Родитель", Родитель);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		// Открытие формы элемента
		ОткрытьФорму("Справочник.AVS_КатегорииНоменклатурыСайт.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
		
		Сообщить("[AVS DEBUG]: Форма создания открыта.");
		
	Исключение
		ТекстОшибки = "[AVS ERROR]: Ошибка при инициировании создания категории: " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		
		// ИСПРАВЛЕНО: Вызываем серверный метод для записи в лог
		AVS_ЗаписатьВЛогНаСервере(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Серверный wrapper для логирования (так как модуль AVS_Логирование недоступен на клиенте)
&НаСервереБезКонтекста
Процедура AVS_ЗаписатьВЛогНаСервере(ТекстСообщения)
	
	Попытка
		// На сервере общий модуль AVS_Логирование доступен напрямую
		AVS_Логирование.ЗаписатьВЛог(ТекстСообщения);
	Исключение
		// Если даже запись в лог-файл упала, фиксируем это в системном Журнале Регистрации
		ЗаписьЖурналаРегистрации("AVS.Интеграция", УровеньЖурналаРегистрации.Ошибка, , , 
			"Критическая ошибка логирования: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// { ПРАВКА_КОНЕЦ }

&НаКлиенте
Процедура AVS_ПереместитьВверх(Команда)
	
	ТекущаяСсылка = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСсылка = Неопределено Или ТекущаяСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если AVS_ИзменитьПорядокНаСервере(ТекущаяСсылка, "ВВЕРХ") Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура AVS_ПереместитьВниз(Команда)
	
	ТекущаяСсылка = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСсылка = Неопределено Или ТекущаяСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если AVS_ИзменитьПорядокНаСервере(ТекущаяСсылка, "ВНИЗ") Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция AVS_ИзменитьПорядокНаСервере(СсылкаКатегории, Направление)
	
	// 1. Получаем данные текущей категории
	ДанныеКатегории = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаКатегории, "Родитель, ПорядокСортировки");
	ТекущийПорядок = ДанныеКатегории.ПорядокСортировки;
	Родитель = ДанныеКатегории.Родитель;
	
	// 2. Ищем соседа (следующего или предыдущего) внутри того же родителя
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Категории.Ссылка КАК Ссылка,
	|	Категории.ПорядокСортировки КАК Порядок
	|ИЗ
	|	Справочник.AVS_КатегорииНоменклатурыСайт КАК Категории
	|ГДЕ
	|	Категории.Родитель = &Родитель
	|	И Категории.ПорядокСортировки " + ?(Направление = "ВВЕРХ", "<", ">") + " &ТекущийПорядок
	|УПОРЯДОЧИТЬ ПО
	|	Категории.ПорядокСортировки " + ?(Направление = "ВВЕРХ", "УБЫВ", "ВОЗР");
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("ТекущийПорядок", ТекущийПорядок);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь; // Соседа нет (уже крайний в списке)
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	// 3. Меняем местами значения ПорядокСортировки
	Попытка
		ОбъектТекущий = СсылкаКатегории.ПолучитьОбъект();
		ОбъектСосед = Выборка.Ссылка.ПолучитьОбъект();
		
		ОбъектТекущий.ПорядокСортировки = Выборка.Порядок;
		ОбъектСосед.ПорядокСортировки = ТекущийПорядок;
		
		// Используем ОбменДанными.Загрузка = Истина, чтобы не срабатывали лишние проверки
		ОбъектТекущий.ОбменДанными.Загрузка = Истина;
		ОбъектСосед.ОбменДанными.Загрузка = Истина;
		
		НачатьТранзакцию();
		ОбъектТекущий.Записать();
		ОбъектСосед.Записать();
		
		AVS_ОбщийМодульСайт.AVS_ЗарегистрироватьИзменение(ОбъектТекущий.Ссылка, "UPDATE");
		AVS_ОбщийМодульСайт.AVS_ЗарегистрироватьИзменение(ОбъектСосед.Ссылка,  "UPDATE");		
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
	Исключение
		Если ТранзакцияАктивна() Тогда ОтменитьТранзакцию(); КонецЕсли;
		Сообщить("[AVS ERROR]: Ошибка при смене порядка: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура AVS_УдалитьКатегорию(Команда)
	
	СсылкаНаКатегорию = Элементы.Список.ТекущаяСтрока;
	
	Если СсылкаНаКатегорию = Неопределено ИЛИ СсылкаНаКатегорию.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем данные о зависимостях (товары и подкатегории)
	РезультатПроверки = AVS_ПроверитьВозможностьУдаленияНаСервере(СсылкаНаКатегорию);
	
	Если РезультатПроверки.ЕстьЗависимости Тогда
		ИмяКатегории = Строка(СсылкаНаКатегорию);
		
		ТекстСообщения = "";
		// Если есть товары - пишем сколько всего товаров
		Если РезультатПроверки.КоличествоТоваров > 0 Тогда
			ТекстСообщения = ТекстСообщения + СтрШаблон("В категории ""%1"" найдено товаров: %2.", ИмяКатегории, РезультатПроверки.КоличествоТоваров);
		КонецЕсли;
		
		// Если есть дочерние категории - добавляем это предложение
		Если РезультатПроверки.ЕстьПодкатегории Тогда
			Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
				ТекстСообщения = ТекстСообщения + Символы.ПС;
			КонецЕсли;
			ТекстСообщения = ТекстСообщения + "Также категория содержит подкатегории.";
		КонецЕсли;
		
		ТекстВопроса = ТекстСообщения + Символы.ПС + "Удаление приведет к полному расформированию связей. Продолжить?";
		
		Оповещение = Новый ОписаниеОповещения("AVS_УдалитьКатегориюЗавершение", ЭтотОбъект, СсылкаНаКатегорию);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		// Если товаров и подкатегорий нет, удаляем сразу
		AVS_ВыполнитьУдалениеНаСервере(СсылкаНаКатегорию);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура AVS_УдалитьКатегориюЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		AVS_ВыполнитьУдалениеНаСервере(Параметры);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

// --- СЕРВЕРНЫЕ ФУНКЦИИ ---
&НаСервереБезКонтекста
Функция AVS_ПроверитьВозможностьУдаленияНаСервере(СсылкаКатегории)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьЗависимости", Ложь);
	Результат.Вставить("КоличествоТоваров", 0);
	Результат.Вставить("ЕстьПодкатегории", Ложь);
	
	// 1. Считаем ВСЕ товары в категории через Регистр Сведений
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Состав.Номенклатура) КАК КолВо
	|ИЗ
	|	РегистрСведений.AVS_СоставКатегорийНоменклатуры КАК Состав
	|ГДЕ
	|	Состав.Категория = &Категория";
	
	Запрос.УстановитьПараметр("Категория", СсылкаКатегории);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.КоличествоТоваров = Выборка.КолВо;
	КонецЕсли;
	
	// 2. Проверяем наличие дочерних категорий
	ЗапросДети = Новый Запрос;
	ЗапросДети.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.AVS_КатегорииНоменклатурыСайт КАК Категории
	|ГДЕ
	|	Категории.Родитель = &Категория";
	
	ЗапросДети.УстановитьПараметр("Категория", СсылкаКатегории);
	Результат.ЕстьПодкатегории = НЕ ЗапросДети.Выполнить().Пустой();
	
	Результат.ЕстьЗависимости = (Результат.КоличествоТоваров > 0) ИЛИ Результат.ЕстьПодкатегории;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура AVS_ВыполнитьУдалениеНаСервере(СсылкаКатегории)
	
	// 1. Очищаем связи в регистре сведений AVS_СоставКатегорийНоменклатуры
	// Это "отключает" товары от категории и удаляет их из неё в базе данных
	НаборЗаписей = РегистрыСведений.AVS_СоставКатегорийНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(СсылкаКатегории);
	
	Попытка
		НаборЗаписей.Записать(); // Запись пустого набора удаляет все записи по фильтру (категории)
	Исключение
		Сообщить("[AVS ERROR]: Ошибка при очистке связей товаров: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	// 2. Физическое удаление самой категории из справочника
	Попытка
		ОбъектКатегории = СсылкаКатегории.ПолучитьОбъект();
		Если ОбъектКатегории <> Неопределено Тогда
			// Используем Удалить() для полного удаления из базы данных
			ОбъектКатегории.Удалить(); 
		КонецЕсли;
	Исключение
		// Если 1С выдаст ошибку (например, есть ссылки в других регистрах, которые мы не учли),
		// то категория останется. В этом случае лучше пометить на удаление как резервный вариант.
		ТекстОшибки = "[AVS ERROR]: Не удалось физически удалить категорию (возможно, есть внешние ссылки). " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		
		Попытка
			ОбъектКатегории = СсылкаКатегории.ПолучитьОбъект();
			ОбъектКатегории.УстановитьПометкуУдаления(Истина);
			Сообщить("Категория была помечена на удаление вместо физического удаления.");
		Исключение
		КонецПопытки;
	КонецПопытки;
	
КонецПроцедуры
